src/Catalogs/НСИИсторияИзмененияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НСИИсторияИзмененияОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтароеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииВСистемеИнициаторе</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииВСистемеКонтролере</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтвержденияВСистемеКонтролере</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИОбъектыДляКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИРеквизитыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаИнициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИИспользуемыеСистемы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИнициатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаКонтролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИИспользуемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательКонтролер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримененоВТекущейСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПримененияВТекущейСистеме</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПоискаНовоеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПоискаСтароеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеКлючаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/НСИИсторияИзмененияОбъектов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗарегистрироватьДляОтправки(Команда)
	
	Попытка
		ОписаниеОшибки = "";	
		
		ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
		
		НСИКлиентСервер.ЗарегистрироватьОчередьРассылки(ТекущаяСтрока.Ссылка,ОписаниеОшибки);
		НСИКлиентСервер.НСИОтправкаИзмененийВФоне(,, ТекущаяСтрока.ЭлементИзменения);	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	СписокЗначений = новый СписокЗначений;
	
	Для к = 0 По Элементы.Список.ВыделенныеСтроки.Количество()-1 Цикл
		СписокЗначений.Добавить(Элементы.Список.ВыделенныеСтроки[к].Ссылка);	
	КонецЦикла;	
	
	НСИКлиентСервер.НСИПрименитьИзменения(СписокЗначений);
КонецПроцедуры

&НаКлиенте
Процедура Архивация(Команда)
	ПолучитьФорму("РегистрСведений.НСИАрхив.ФормаСписка").Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьИсториюНаСервере()
	Выборка = Справочники.НСИИсторияИзмененияОбъектов.Выбрать();
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл	
		ОБъект = Выборка.ПолучитьОбъект();
		ОБъект.Удалить();	
	КонецЦикла;
		
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсторию(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если Вопрос("История будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ОчиститьИсториюНаСервере();
		
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьИсториюЗавершение", ЭтотОбъект), "История будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	#КонецЕсли
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводВXML(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файл XML (*.xml)|*.xml|Все файлы|*.*";
	
	Если Диалог.Выбрать() Тогда
	
		СписокЗначений = Новый СписокЗначений;
		Для к = 0 По Элементы.Список.ВыделенныеСтроки.Количество()-1 Цикл
			СписокЗначений.Добавить(Элементы.Список.ВыделенныеСтроки[к].Ссылка);	
		КонецЦикла;
	
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		
		ОписаниеОшибки = НСИКлиентСервер.СохранитьДанныеДляОтправкиВФайл(СписокЗначений, ПутьКФайлу);
		
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Сообщить(ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаИспользоватьОтборы.Пометка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборы(Команда)
	
	Элементы.ФормаИспользоватьОтборы.Пометка = Не Элементы.ФормаИспользоватьОтборы.Пометка;
	НовоеЗначение = Элементы.ФормаИспользоватьОтборы.Пометка;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		ЭлементОтбора.Использование = НовоеЗначение;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГруппировки(Команда)
	
	Элементы.ФормаИспользоватьГруппировки.Пометка = Не Элементы.ФормаИспользоватьГруппировки.Пометка;
	НовоеЗначение = Элементы.ФормаИспользоватьГруппировки.Пометка;
	
	УстановитьГруппировкуНаСервере(НовоеЗначение);//->Lexa 141021
	
КонецПроцедуры

//->Lexa 141021
&НаКлиенте
Процедура ОчиститьИсториюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    ОчиститьИсториюНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьГруппировкуНаСервере(Флаг)
	Для Каждого ЭлементГруппировки Из Список.Группировка.Элементы Цикл
		ЭлементГруппировки.Использование = Флаг;
	КонецЦикла;
КонецПроцедуры
//<-Lexa 141021
